In [5]:
import pandas as pd
import os

pd.set_option('display.max_colwidth', None)  # show full text in each cell
pd.set_option('display.max_rows', 10)      # show all rows (optional)
pd.set_option('display.max_columns', None)  


folder_original = os.path.expanduser("~/PycharmProjects/PythonProject/resources/movies.json")
df_from_json = pd.read_json(folder_original)
print(len(df_from_json)) # no of rows
print(df_from_json)

36
             director            movie  rating
0   Christopher Nolan        Inception      10
1   Christopher Nolan     Interstellar      10
2   Christopher Nolan  The Dark Knight      10
3   Christopher Nolan            Tenet      10
4   Christopher Nolan          Memento      10
..                ...              ...     ...
31     A R Murugadoss          Ghajini      10
32     A R Murugadoss        Thuppakki      10
33     A R Murugadoss          Kaththi      10
34     A R Murugadoss           Ramana      10
35     A R Murugadoss           Spyder      10

[36 rows x 3 columns]

In [7]:
print(df_from_json.head())
print(df_from_json.tail())

            director            movie  rating
0  Christopher Nolan        Inception      10
1  Christopher Nolan     Interstellar      10
2  Christopher Nolan  The Dark Knight      10
3  Christopher Nolan            Tenet      10
4  Christopher Nolan          Memento      10
          director      movie  rating
31  A R Murugadoss    Ghajini      10
32  A R Murugadoss  Thuppakki      10
33  A R Murugadoss    Kaththi      10
34  A R Murugadoss     Ramana      10
35  A R Murugadoss     Spyder      10

In [8]:
df_from_json[['director', 'movie']] # display only specific columns

             director            movie
0   Christopher Nolan        Inception
1   Christopher Nolan     Interstellar
2   Christopher Nolan  The Dark Knight
3   Christopher Nolan            Tenet
4   Christopher Nolan          Memento
..                ...              ...
31     A R Murugadoss          Ghajini
32     A R Murugadoss        Thuppakki
33     A R Murugadoss          Kaththi
34     A R Murugadoss           Ramana
35     A R Murugadoss           Spyder

[36 rows x 2 columns]

In [9]:
df_from_json.iloc[0:6, 1]

0          Inception
1       Interstellar
2    The Dark Knight
3              Tenet
4            Memento
5       The Prestige
Name: movie, dtype: object

In [10]:
df_from_json[df_from_json['director'].isin(['Christopher Nolan', 'Vetrimaran'])]

             director               movie  rating
0   Christopher Nolan           Inception      10
1   Christopher Nolan        Interstellar      10
2   Christopher Nolan     The Dark Knight      10
3   Christopher Nolan               Tenet      10
4   Christopher Nolan             Memento      10
..                ...                 ...     ...
26         Vetrimaran              Asuran      10
27         Vetrimaran        Vada Chennai      10
28         Vetrimaran         Polladhavan      10
29         Vetrimaran           Visaranai      10
30         Vetrimaran  Viduthalai: Part 1      10

[11 rows x 3 columns]